<details><summary>Digger run report at 2024-01-09 05:27:07 (UTC)</summary>
  <details><summary>Apply for <b>mileslee-nsuslab/quickstart-actions-aws#terraform_gp_2134_global_vpc</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_vpc.vpc_network will be created
  + resource "aws_vpc" "vpc_network" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "terraform-network"
        }
      + tags_all                             = {
          + "Name" = "terraform-network"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_vpc.vpc_network: Creating...
aws_vpc.vpc_network: Creation complete after 2s [id=vpc-06ce91119eb81ccce]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>
</details>